Autodesk.Revit.DB.Events.ProgressStage
The associated action of a ProgressChanged event
Since:
2013
Since:
2013

Autodesk.Revit.DB.Events.ProgressStage.Finished
Progress bar is finished

Autodesk.Revit.DB.Events.ProgressStage.Unchanged
Progress bar has not changed position

Autodesk.Revit.DB.Events.ProgressStage.CaptionChanged
Progress bar  has set new Text

Autodesk.Revit.DB.Events.ProgressStage.PositionChanged
Progress bar has set new position

Autodesk.Revit.DB.Events.ProgressStage.RangeChanged
Progress bar has set new range

Autodesk.Revit.DB.Events.ProgressStage.Started
Progress bar has started